Revit 2027 API
StairsType.NotchThickness Property
 The vertical length of the notch profile from the top.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NotchThickness { get; set; }
Public Property NotchThickness As Double
	Get
	Set
public:
property double NotchThickness {
	double get ();
	void set (double value);
}
member NotchThickness : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for notchThickness must be between 0 and 30000 feet.
InvalidOperationException |  When setting this property: The construction method of the stairs type is not "Precast" or the StairsEndConnectionType of the stairs type is not "Notch", so this related data cannot be set.
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace